CSI API ETABS v1
cTendonObj Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cTendonObj
Public Interface cTendonObj
Dim instance As cTendonObj
public interface class cTendonObj
type cTendonObj =  interface end
The cTendonObj type exposes the following members.
Methods
Name | Description
ChangeName
Count
GetDatumOffset
 Retrieves the datum offset - intended for internal use
GetDrawingPoint
 Retrieves drawing point data - intended for internal use
GetGroupAssign
 Retrieves the groups to which a tendon object is assigned.
GetLoadForceStress_1
 Retrieves tendon load data
GetLossesDetailed
 Retrieves tendon loss data - detailed
GetLossesFixed
 Retrieves tendon loss data - fixed
GetLossesPercent
 Retrieves tendon loss data - percentage
GetNameList
GetNameListOnStory
GetNumberStrands
 Retrieves the number of strands
GetProperty
GetSelected
GetTendonGeometry
SetGroupAssign
 Adds/removes tendon objects to/from a specified group.
SetSelected
Top
See Also
Reference
ETABSv1 Namespace